Revit 2027 API
GridNode Structure
A structure that represents a particular location in (U,V) from a grid.
Inheritance Hierarchy
System.Object
 System.ValueType
 Autodesk.Revit.DB.GridNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public struct GridNode
Public Structure GridNode
public value class GridNode
[<SealedAttribute>]
type GridNode =
    struct
        inherit ValueType
    end
The GridNode type exposes the following members.
Constructors
Name | Description
GridNode | Initializes a new instance of the GridNode class
Top
Properties
Name | Description
UIndex | The node's index along the U axis.
VIndex | The node's index along the V axis.
Top
Methods
Name | Description
Equals | Indicates whether this instance and a specified object are equal.
(Inherited from ValueType)
GetHashCode | Returns the hash code for this instance.
(Inherited from ValueType)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns the fully qualified type name of this instance.
(Inherited from ValueType)
Top
See Also
Reference
Autodesk.Revit.DB Namespace